# GetTextLength

## Description
GetTextLength returns the string length of the referenced text object.

```pascal
FUNCTION GetTextLength(TextHd : HANDLE): INTEGER;
```

```python
def vs.GetTextLength(TextHd):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|TextHd|HANDLE|Handle to text object.|

## Version
Availability: from VectorWorks8.0

## Category
* Objects - Text